In [5]:
import pandas as pd

# создаем датафрейм с колонкой Salary  со значением [114000, 50000, 100000]
# 1) преобразуем их в строки вида "45000 руб" и сохраним в новой колонке
# 2) из полученных строк извелечем обратно числа и приведем их к типу int в новой колонке


df = pd.DataFrame({"Salary": [114000, 50000, 100000]})  

df["Salary2"] = df["Salary"].astype(str) + " руб"
print(df["Salary2"],'\n')

df["Salary3"] = df["Salary2"].str.extract(r'(\d+)').astype(int)
#df["Salary3"] = df["Salary2"].str.extract(r'(\d+)').astype(int)

print(df["Salary3"])

df

0    114000 руб
1     50000 руб
2    100000 руб
Name: Salary2, dtype: object

0    114000
1     50000
2    100000
Name: Salary3, dtype: int64

   Salary     Salary2  Salary3
0  114000  114000 руб   114000
1   50000   50000 руб    50000
2  100000  100000 руб   100000

In [7]:
print("Типы столбцов\n", df.dtypes)

Типы столбцов
 Salary      int64
Salary2    object
Salary3     int64
dtype: object

In [9]:
# Датафрейм с колонкой "City" со строками [" moscow", "SPb", "kaZAN "]
# преобразовать все значения колонки City в новом столбце к виду " moscow" - "Moscow"

df = pd.DataFrame({"City": [" moscow", "SPb", "kaZAN "]})  
df['City2'] = df['City'].str.title().str.strip()

df

      City   City2
0   moscow  Moscow
1      SPb     Spb
2   kaZAN    Kazan

In [12]:
# "Score" - [85, 90, 95]
# преобразуем к виду score_85

df = pd.DataFrame({"Score": [85, 90, 95]})  
df["Score2"] = "score_" + df["Score"].astype(str)
#df["Score3"] = df["Score2"].str.extract(r'(\d+)').astype(int)
df["Score3"] = df["Score2"].str.replace('score_','').astype(int)
df

   Score    Score2  Score3
0     85  score_85      85
1     90  score_90      90
2     95  score_95      95

In [13]:
df.dtypes

Score      int64
Score2    object
Score3     int64
dtype: object

In [15]:
# Датафрейм с колонкой "URL" ["https://site.org", "https://example.com", "https://docs.org"]
# Отфильтруем строки где адрес заканчивается на "org"

import pandas as pd

# Исходный датафрейм
df = pd.DataFrame({
    "URL": ["https://site.org", "https://example.com", "https://docs.org"]
})

#df2 = df[df["URL"].str.endswith("org")]

mask=df["URL"].str.contains(r"\.org$", regex=True)
df2=df[mask].copy()

df2

                URL
0  https://site.org
2  https://docs.org

In [21]:
# DataFrame с колонкой Record со строками формата -  (3 строки)
#"id=105; user=Alice; score=92"
#"id=106; user=Bob; score=88"
#"id=107; user=Carol; score=95"
# извлечь user и score в отдельные колонки

# Исходный DataFrame
df = pd.DataFrame({
    "Record": [
        "id=105; user=Alice; score=92",
        "id=106; user=Bob; score=88", 
        "id=107; user=Carol; score=95"
    ]
})

split_df = df['Record'].str.split('; ', expand=True)
df['user'] = split_df[1].str.split('=').str[1]
df['score'] = split_df[2].str.split('=').str[1]

# Извлечение user и score с помощью регулярного выражения
df[['user', 'score']] = df['Record'].str.extract(r'user=([^;]+); score=(\d+)')
df[['user', 'score']] = df['Record'].str.extract(r""r'user=([^;]+); score=(\d+)')
df

                         Record   user score
0  id=105; user=Alice; score=92  Alice    92
1    id=106; user=Bob; score=88    Bob    88
2  id=107; user=Carol; score=95  Carol    95

In [22]:
df[['user', 'score']] = df['Record'].str.extract(r'user=([^;]+); score=(\d+)')
df

                         Record   user score
0  id=105; user=Alice; score=92  Alice    92
1    id=106; user=Bob; score=88    Bob    88
2  id=107; user=Carol; score=95  Carol    95

In [24]:
# DataFrme с колонкой Record со строкоами формата - "id=105; user=Alice; score=92",
# "id=106; user=Bob; score=88",
# "id=107; user=Carol; score=95"
# извлечь user и score в отдельные колонки

df = pd.DataFrame({
"Record": [
"id=105; user=Alice; score=92",
"id=106; user=Bob; score=88",
"id=107; user=Carol; score=95"
]
})
df


extracted = df["Record"].str.extract(r"user=(?P<user>[^;]+);\s*score=(?P<score>\d+)") # именованные группы в регулярке
extracted


extracted["score"] = extracted["score"].astype(int)

df = pd.concat([df, extracted], axis = 1)
df


#df.dtypes

                         Record   user  score
0  id=105; user=Alice; score=92  Alice     92
1    id=106; user=Bob; score=88    Bob     88
2  id=107; user=Carol; score=95  Carol     95

In [29]:
# датафрейм .. колонки Name, Age ... 3 строки
# второй теже колонки 2 строки
# обьединим датафреймы

df1 = pd.DataFrame({
    "Name": ['Alice', 'Bob', 'Carol'],
    "Age": [26, 25, 30]      
})

df2 = pd.DataFrame({
    "Name": ['Piter', 'Sam'],
    "Age": [21, 27]      
})


df3 = pd.concat([df1, df2], ignore_index=True)
df3

    Name  Age
0  Alice   26
1    Bob   25
2  Carol   30
3  Piter   21
4    Sam   27

In [30]:
# преобразуем список словарей [{"City: "Moscow", "Population": 15},{},{}] в датафрейм
# сделаем City - индексом и отсортируем по Population

data = [
    {"City": "Moscow", "Population": 15},
    {"City": "Kazan", "Population": 1.5},
    {"City": "Spb", "Population": 5.5},
]

df = pd.DataFrame(data)
df = df.set_index('City')
df = df.sort_values('Population', ascending=False)

df

        Population
City
Moscow        15.0
Spb            5.5
Kazan          1.5